import React from 'react';
import { WebView } from 'react-native-webview';

export default function PersonalInfoScreen(): React.ReactElement {
  return (
    <WebView
      source={{
        html: `<p class="p1"><span class="s1">이용약관</span></p>
        <p class="p2">
          <span class="s1"
            >본 서비스 약관(이하 "약관")은 귀하가 달달한 오렌지 떡볶이 (이하
            "달오떡" 혹은 "당사")의 서비스(이하 "서비스" 또는 "Bouquet")뿐만 아니라
            Bouquet상에서 업로드 또는 다운로드되거나 보여지는 정보, 문구, 그래픽,
            사진 또는 기타 자료(이하 통칭하여 "콘텐츠")에 액세스하여 이를 이용하는
            행위 일체에 적용됩니다. 귀하는 Bouquet를 이용하시기 전 본 약관을
            숙독하시어 이해하시고 동의하셔야 합니다. 귀하가 Bouquet에 액세스하고
            이용하는 행위는 귀하가 본 약관에 동의하고 이에 준수하는 것을 의미합니다.
            따라서 본 약관을 숙독하시기 바랍니다. 귀하는 본 약관을 읽고 동의하신
            후에 Bouquet에 엑세스할 수 있습니다.</span
          >
        </p>
        <p class="p2"><span class="s1"> </span></p>
        <p class="p2"><span class="s1">1. 귀하와 달오떡 간의 동의</span></p>
        <p class="p2">
          <span class="s1"
            >1.1. 귀하가 달오떡에 제공하는 정보 일체는 당사의 개인정보취급방침에
            따르며, 당사가 귀하의 정보를 수집 및 이용하는 행위는 같은 정책이
            적용됩니다. 귀하는 본 서비스를 이용함으로써 달오떡이 귀하의 정보를 수집
            및 이용(개인정보취급방침에서 규정하는 바와 같음)하는 것에 동의하는
            것으로 간주된다는 사실을 인지하고 있습니다. 귀하에게 본 서비스를
            제공하는 것의 일환으로, 당사는 서비스 관련 공지사항 및 행정적 사안에
            관한 메시지를 비롯한 전달사항을 제공할 필요가 있을 수 있습니다. 이러한
            전달사항은 본 서비스 및 귀하의 달오떡 계정의 일부로 간주되며, 귀하는
            이를 수신거부 할 수 없습니다.</span
          >
        </p>
        <p class="p2">
          <span class="s1"
            >1.2. 당사의 서비스를 이용함으로써 귀하는 법률에 의해 허용된 범위 내에서
            아래와 같은 요소로 인해 발행하는 모든 제3자의 청구 또는 요구로부터
            달오떡 그리고 달오떡의 임직원, 소유자, 임원 및 대리인(이하 달오떡
            Group)이 피해를 입지 않도록 하는데 동의합니다. 1) 귀하의 서비스 이용, 2)
            콘텐츠 (게시글, 이미지, 비디오, 기타 자료 포함), 3) 귀하의 서비스 접속,
            4) 본 약관에 대한 귀하의 위반, 그리고 5) 기타 적용가능한 법률의
            위반</span
          >
        </p>
        <p class="p2"><span class="s1"> </span></p>
        <p class="p2"><span class="s1">2. 기본 약관</span></p>
        <p class="p2">
          <span class="s1"
            >2.1. 서비스의 사용과 서비스에 게시하는 콘텐츠, 그에 따른 결과에 대한
            책임은 귀하에게 있습니다. 귀하가 게시판에 제출, 게시, 표시하는 콘텐츠는
            동일한 게시판에 콘텐츠를 제출, 게시, 표시할 권리가 있는 다른 이용자가
            열람할 수 있습니다. 귀하는 본 약관에 따라 다른 사람들과 공유하여도
            불편하지 않은 콘텐츠만을 제공하여야 합니다. 귀하는 서비스를 이용하거나
            콘텐츠를 게시함으로써 당사의 커뮤니티 가이드라인을 검토하고 준수할 것에
            동의합니다.</span
          >
        </p>
        <p class="p2">
          <span class="s1"
            >2.2. 귀하는 달오떡과 구속력 있는 계약을 체결할 수 있으며 대한민국
            법률이나 기타 적용되는 관할권에 따라 서비스를 제공받는 것이 금지되지
            않는 개인인 경우에 한해서만 본 서비스를 이용할 수 있습니다.</span
          >
        </p>
        <p class="p2">
          <span class="s1"
            >2.3. 달오떡이 제공하는 본 서비스는 언제든지 변경될 수 있으며, 달오떡이
            제공하는 본 서비스의 형태 및 성격은 귀하에 대한 사전 통지 없이 수시로
            변경될 수 있습니다. 또한, 달오떡은 귀하 또는 제반 이용자에 대한 본
            서비스(또는 본 서비스에 포함된 특정 기능)의 제공을 (영구적 또는
            일시적으로) 중단할 수 있으며, 귀하에게 사전 통지를 제공하지 못할 수도
            있습니다. 당사는 또한 당사의 단독 재량에 따라 언제든지 귀하에 대한 사전
            통지 없이 이용 및 저장에 대한 제한을 설정할 수 있는 권리를
            보유합니다.</span
          >
        </p>
        <p class="p2">
          <span class="s1"
            >2.4. 본 서비스는 본 서비스상의 콘텐츠, 본 서비스와 관련하여 제기되는
            질의사항, 그리고 기타 정보 등을 기반으로 타게팅하는 광고를 포함할 수
            있습니다. 달오떡이 본 서비스상에서 행하는 광고의 종류 및 범위는 변경될
            수 있습니다. 달오떡이 귀하로 하여금 본 서비스에 액세스하고 본 서비스를
            이용할 수 있도록 하는 데 대한 대가로서, 귀하는 달오떡, 달오떡의 제3자
            제공자(서비스 퍼블리싱 업체 등)들 및 파트너사 등이 본 서비스상에 또는 본
            서비스 내의 콘텐츠 등의 정보와 함께 (귀하가 제공한 것인지 또는
            타이용자들이 제공한 것인지의 여부를 불문함) 본 서비스 내에 광고를 게재할
            수 있음에 동의합니다.</span
          >
        </p>
        <p class="p2"><span class="s1"> </span></p>
        <p class="p2"><span class="s1">3. 사용자 콘텐츠</span></p>
        <p class="p2">
          <span class="s1"
            >3.1. 소유권: 콘텐츠에 대한 일체의 권리 및 소유권은 사용자에게 있습니다.
            본 서비스를 통해 게시되었거나 본 서비스를 통해 귀하가 입수한 콘텐츠나
            자료를 이용하거나 이에 의존하는 것은 귀하의 위험부담으로 합니다.</span
          >
        </p>
        <p class="p2">
          <span class="s1"
            >당사는 본 서비스를 통해 게시된 콘텐츠 및 의사소통 내용의 완전성,
            진실성, 정확성, 신뢰성을 확인, 지지, 대표, 보증하지 않고 본 서비스를
            통해 표출된 어떠한 의견도 지지하지 않습니다. 귀하는 본 서비스를 이용하는
            과정에서 불쾌하거나, 유해하거나, 부정확하거나, 부적절하거나,
            허위제목으로 등록되었거나, 기만적인 게시물에 노출될 수도 있음을 인지하고
            있습니다. 달오떡은 어떠한 경우에도, 콘텐츠의 신뢰성에 대한(콘텐츠상의
            오류나 누락을 포함하되 이에 한정되지 아니함) 책임을 부담하지 않으며, 본
            서비스를 통해 게시되거나, 이메일 등의 방식으로 전송되거나, 서비스를 통해
            제공되거나, 타 매체에 게시됨으로 인해서 발생하는 종류를 불문한 손실이나
            손해 일체에 대한 책임을 부담하지 않습니다.</span
          >
        </p>
        <p class="p2">
          <span class="s1"
            >3.2. 용도: 귀하는 전 세계의 모든 미디어에서 귀하의 콘텐츠를 사용, 복사,
            수행, 전시, 파생물 제작, 개조 및 배포할 수 있는 무제한의, 취소 불가한,
            영구적인, 비 독점적인, 로열티 무료의 라이센스를 당사에 부여합니다. 관련
            법률이 허용하는 최대 한도 내에서, 귀하는 상기 라이센스의 행사에 적용되는
            귀하의 모든 도덕적 권리를 포기합니다.</span
          >
        </p>
        <p class="p2">
          <span class="s1"
            >3.3. 비밀번호: 귀하는 귀하가 본 서비스에 액세스하기 위하여 이용하는
            비밀번호의 보호 및 귀하의 비밀번호를 이용한 활동이나 행위 일체에 대한
            책임을 부담합니다. 당사는 귀하에게 "강력한" 비밀번호(대</span
          ><span class="s2">∙</span
          ><span class="s1"
            >소문자, 숫자 및 특수문자를 조합한 형태의 비밀번호)를 설정할 것을
            권장합니다. 달오떡은 귀하가 상기를 준수하지 아니함으로 인하여 발생하는
            손실이나 손해에 대한 책임을 부담할 수 없으며, 이는 향후에도 마찬가지
            입니다.</span
          >
        </p>
        <p class="p2">
          <span class="s1"
            >3.4. 컨텐츠 및 서비스 이용 제한 사항. 서비스 운영 주체는 사용자가
            작성한 컨텐츠를 숨김처리하거나, 서비스 이용을 제한 혹은 특정 닉네임
            이용을 제한하기 위한 권리를 갖고 있습니다. 이 약관에 따라 아래에 해당
            하는 행위를 한 사용자의 계정에 대해서는 서비스 이용이 제한될 수
            있습니다.</span
          >
        </p>
        <p class="p2">
          <span class="s1"
            >• 불법적/차별적/악의적인 사항에 대한 논의 선동행위.</span
          >
        </p>
        <p class="p2">
          <span class="s1"
            >• 특정인의 명예훼손, 위협, 희롱하는 등의 행위나 개인정보보호 및
            지적재산권 등의 법적인 권리를 위반하는 행위.</span
          >
        </p>
        <p class="p2">
          <span class="s1"
            >• 소통공간에 적합하지 않은 공격적인, 포르노성의, 위협적인, 공포스러운
            류의 이미지 게재행위.</span
          >
        </p>
        <p class="p2">
          <span class="s1">• 서비스의 제작 의도 등에 반하는 내용의 게재행위.</span>
        </p>
        <p class="p2">
          <span class="s1"
            >3.5. 당사는 콘텐츠를 모니터링하며 악의적이나 불법적인 콘텐츠를 없애기
            위해 노력하지만 지적재산권 위반이나 기밀정보 남용과 같은 불법행위에 대한
            책임을 부담하지 않습니다.</span
          >
        </p>
        <p class="p2"><span class="s1"> </span></p>
        <p class="p2"><span class="s1">4. 서비스 이용 라이선스</span></p>
        <p class="p2">
          <span class="s1"
            >달오떡은 본 서비스의 일환으로 당사가 귀하에게 제공하는 소프트웨어를
            이용할 수 있는 개인적이고, 전 세계적이고, 무상으로 제공되고, 양도
            불가능하며, 비독점적인 라이센스를 허여합니다. 본 라이센스는 오로지
            귀하로 하여금 본 약관에서 허용하는 방식에 따라 달오떡이 제공하는 본
            서비스를 이용하고 향유할 수 있도록 하는 것만을 목적으로 합니다. 귀하의
            서비스 이용 라이선스는 무효화될 수 있으며 달오떡은 언제든지 귀하의
            Bouquet이용 권리를 제한하거나 해지시킬 수 있습니다.</span
          >
        </p>
        <p class="p2">
          <span class="s1"
            >4.1. 계정 정보: 귀하는 서비스를 사용하기 위해 당사에 계정을 개설해야
            합니다. 로그인 정보를 안전하게 보관하는 것은 귀하의 책임이며 귀하는
            본인의 계정을 통해 발생하는 모든 활동에 대해 책임을 져야 합니다.</span
          >
        </p>
        <p class="p2"><span class="s1"> </span></p>
        <p class="p2"><span class="s1">5. 달오떡 권리.</span></p>
        <p class="p2">
          <span class="s1"
            >본 서비스(귀하들이 제공하는 콘텐츠를 제외함)에 대한 권리, 소유권 및
            이권 일체는 달오떡 및 달오떡의 저작권 소유자들의 독점 자산이며, 이는
            향후에도 마찬가지 입니다. 본 서비스는 저작권 및 상표권에 따라
            보호됩니다. 본 약관에 포함된 어떠한 조항도 귀하에게 달오떡 명칭이나
            달오떡 상표, 로고, 도메인네임 및 기타 특유의 브랜드 표장을 사용할 수
            있는 권리를 부여하지 않습니다. 귀하가 달오떡이나 본 서비스에 관하여
            제공하는 피드백, 의견이나 제안사항은 전적으로 자발적인 것으로서, 당사는
            당사가 적절하다고 판단하는 피드백, 의견이나 제안사항을 귀하에 대한
            의무부담 없이 자유로이 사용할 수 있습니다.</span
          >
        </p>
        <p class="p2"><span class="s1"> </span></p>
        <p class="p2"><span class="s1">6. 저작권 정책</span></p>
        <p class="p2">
          <span class="s1"
            >달오떡은 타인의 지적재산권을 존중하며, 본 서비스 이용자들이 타인의
            지적재산권을 존중할 것이라 기대합니다. 당사는 관계 법률을 준수하여
            합리적으로 당사에 제공된 저작권위반 신고에 대한 답변을 제공합니다.
            귀하의 콘텐츠가 저작권 침해행위의 소지가 있는 방식으로 복제되었다고
            판단하시는 경우, 당사에 다음에 해당하는 정보를 제공해주시기 바랍니다:
            (i) 저작권자나 당해 저작권자를 대리하도록 수권 받은 자의 실제서명이나
            전자서명; (ii) 침해 당했다고 주장되는 저작물 식별자료; (iii)
            침해적이라거나 침해행위의 주체라고 주장되는 것으로서 삭제되어야 하거나
            해당 자료에 대한 액세스를 제한해야 하는 자료를 식별할 수 있는 정보 및
            당사가 해당 자료를 추적할 수 있도록 합리적으로 충분한 정보; (iv) 귀하의
            주소, 전화번호 및 전자우편 주소 등 귀하의 연락처; (v) 문제가 제기된
            방식으로 해당 자료를 이용하는 행위가 저작권자, 저작권자의 대리인 또는
            법률에 의해 허용된 것이 아니라고 판단한다는 것을 내용으로 하는 귀하의
            진술서; 및 (vi) 신고서상의 정보가 정확한 것이며, 귀하가 해당 저작권자를
            대리하여 행위 하도록 수권 받았음을 내용으로 하는, 위증죄에 대한 처벌을
            감수하는 진술서.</span
          >
        </p>
        <p class="p2">
          <span class="s1"
            >당사는 위법이 의심되는 콘텐츠에 대해서는 사전 통지 없이, 당사의 단독
            재량으로, 이용자에 대해서 책임을 묻지 않고 삭제할 수 있는 권리를
            보유합니다. 적절한 상황에서, 달오떡은 귀하가 상습 침해자로 판명되는 경우
            해당 귀하의 계정을 또한 해지합니다. 본 서비스상에서의 주장되는
            저작권침해 신고를 담당하는 당사의 지정 저작권 책임자는 아래와
            같습니다:</span
          >
        </p>
        <p class="p2">
          <span class="s1"
            >달오떡,<span class="Apple-converted-space"> </span></span
          >
        </p>
        <p class="p2">
          <span class="s1">수신: 저작권 책임자(Copyright Agent)</span>
        </p>
        <p class="p2"><span class="s1">이메일: support@bouquet.ooo</span></p>
        <p class="p2"><span class="s1"> </span></p>
        <p class="p2"><span class="s1">7. 보증거부.</span></p>
        <p class="p2">
          <span class="s1"
            >7.1. 서비스에 접속하거나 서비스를 이용하는 귀하는 공격적이거나
            외설적이거나 불쾌할 수 있는 타인의 자료에 노출될 수 있음을 인정 및
            동의하고 이러한 위험을 감수하는 데 동의해야 합니다. 당사의 웹사이트나
            서비스를 통해 표시되는 의견은 당사의 의견을 반영하지 않습니다. 당사는
            귀하나 타인이 게시하는 콘텐츠를 지지 또는 보증하지 않습니다. 타인의 특정
            콘텐츠는 정확하게 표시, 평가, 분류되지 않을 수 있습니다.</span
          >
        </p>
        <p class="p2">
          <span class="s1"
            >7.2. 당사는 귀하의 콘텐츠를 보호하기 위해 합리적인 보안 조치를
            제공하지만 귀하의 콘텐츠 공개로 발생하는 손해에 대해 책임지지
            않습니다.</span
          >
        </p>
        <p class="p2">
          <span class="s1"
            >7.3. 보증거부: 귀하는 달오떡의 서비스가 준거법이 허용하는 한도 내에서,
            명시적이거나 암묵적인 법적인 일체의 보증 없이, ‘있는 그대로’ 제공된다는
            점을 이해 및 동의합니다. 예를 들어, 당사는 다음 사항에 대해 보증하지
            않습니다. (a) 서비스가 귀하의 요구 사항에 부합하거나, 항상 신속하고
            안전하고 오류 없이 제공됨. (b) 서비스 사용에서 획득할 수 있는 결과가
            효과적이거나 정확하거나 신뢰할 수 있음. (c) 사이트나 서비스, 자료의 모든
            오류나 하자가 시정됨.</span
          >
        </p>
        <p class="p2"><span class="s1"> </span></p>
        <p class="p2"><span class="s1">8. 당사의 유한책임.</span></p>
        <p class="p2">
          <span class="s1"
            >8.1. 유한책임: 달오떡 Group은 어떤 경우에도 특수, 우발, 간접, 결과적,
            징벌적 손해 일체에 대해 귀하나 타인에게 책임을 지지 않습니다.</span
          >
        </p>
        <p class="p2">
          <span class="s1"
            >8.2. 본 약관과 관련하여 달오떡 당사자들이 부담하는 총 책임은 귀하가
            해당 청구를 초래한 서비스에 대하여 지난 3개월간 달오떡에 지급한 금액 중
            보다 큰 금액을 초과하지 않습니다.</span
          >
        </p>
        <p class="p2">
          <span class="s1"
            >8.3. 본 조의 유한 책임 및 예외 조항은 귀하의 관할 준거법을 참조하되,
            해당 범위 내에서 상기 기술한 내용을 최대한 반영합니다.</span
          >
        </p>
        <p class="p2"><span class="s1"> </span></p>
        <p class="p2"><span class="s1">9. 달오떡과의 분쟁 해결.</span></p>
        <p class="p2">
          <span class="s1"
            >9.1. 귀하는 귀하와 달오떡의 관계가 대한민국 법률에 의해 지배되고,
            어떠한 성격의 청구나 불만도 대한민국 지방 법원에 독점적으로 제기된다는
            점에 동의합니다.</span
          >
        </p>
        <p class="p2">
          <span class="s1"
            >9.2. 보증거부: 귀하와 달오떡은 각자 국제 물품 매매 계약에 관한 국제
            연합 협약을 거부합니다. 당사자 양측은 서비스에 이를 적용하지 않기로
            합의합니다.</span
          >
        </p>
        <p class="p2"><span class="s1"> </span></p>
        <p class="p2"><span class="s1">10. 해지.</span></p>
        <p class="p2">
          <span class="s1"
            >10.1. 귀하는 언제든지 서비스 이용을 중단할 수 있습니다.</span
          >
        </p>
        <p class="p2">
          <span class="s1"
            >10.2. 당사는 특징이나 기능을 추가, 수정, 제거하고 서비스를 중지 또는
            중단할 수 있습니다. 아울러 언제든지 귀하에 대한 서비스 제공을 중단하거나
            서비스의 기능을 축소할 수 있습니다.</span
          >
        </p>
        <p class="p2">
          <span class="s1"
            >10.3. 계정 해지 이전에 귀하가 당사에 서비스 이용 비용 등을 지불한
            경우(당사가 유료 서비스를 귀하에게 제공한 경우에 한해), 귀하가 지불한
            비용은 환급되지 않습니다. 귀하 계정 해지는 해지 이전에 귀하와 당사간에
            합의된 지불 의무를 면제하지 않습니다.</span
          >
        </p>
        <p class="p2">
          <span class="s1"
            >10.4. 서비스를 폐지 또는 중단하는 경우, 당사는 귀하에게 이를 통지하고
            콘텐츠를 회수할 기회를 제공하기 위해 합당한 노력을 기울이겠습니다.
            관리자가 귀하의 서비스 접속을 해지하는 경우 귀하는 본인이나 타 구성원이
            해당 서비스에 게시한 콘텐츠에 접속할 수 없습니다.</span
          >
        </p>
        <p class="p2"><span class="s1"> </span></p>
        <p class="p2"><span class="s1">11. 통지.</span></p>
        <p class="p2">
          <span class="s1"
            >11.1. 달오떡에 대한 통지: 본 약관이나 추가 약관이 별도로 명기하지 않는
            한, 귀하는 아래 주소로 통지를 발송해야 합니다. 달오떡 ,
            support@bouquet.ooo.</span
          >
        </p>
        <p class="p2">
          <span class="s1"
            >11.2. 귀하에 대한 통지: 서비스 관련 메시지나 공지 등을 위해서 팀
            달오떡은 서비스 페이지 내에 배너 등 다른 적합한 방법을 이용하여 귀하에게
            알립니다. 해당 방법은 당사가 취할 수 있는 최대한의 적극적인 고지
            방식임에 동의하며, 귀하는 귀하가 서비스에 관련한 중요한 정보를 수신하지
            않아서 발생한 혹은 그와 관련된 어떠한 책임도 당사는 지지 않음을 승인 및
            동의합니다.</span
          >
        </p>
        <p class="p2"><span class="s1"> </span></p>
        <p class="p2"><span class="s1">12. 일반 약관</span></p>
        <p class="p2">
          <span class="s1"
            >12.1. 수출 규제: 귀하의 서비스와 서비스의 취급 행위는, 달오떡의
            서비스와 콘텐츠의 수출입 및 사용에 적용될 수 있는 국제적인 법률, 제한
            규정, 법령의 적용을 받습니다. 귀하는 해당 법률, 제한 규정, 법령 일체의
            준수에 동의해야 합니다.</span
          >
        </p>
        <p class="p2">
          <span class="s1"
            >12.2. 일부 무효의 원칙: 법원이 약관의 일부를 무효나 집행 불능으로
            판단하는 경우 잔여 약관은 그대로 적용됩니다.</span
          >
        </p>
        <p class="p2">
          <span class="s1"
            >12.3. 기권 금지: 당사가 귀하를 상대로 약관을 집행하지 않을 경우(또는
            집행을 지연하는 경우) 이는 당사의 집행권을 유보한 것이 아닙니다.</span
          >
        </p>
        <p class="p2">
          <span class="s1"
            >12.4. 양도 또는 이전: 귀하는 달오떡의 사전 허가 없이 본 계약에 따른
            권리나 의무를 타인에게 양도 또는 이전할 수 없습니다. 당사는 귀하의 허가
            없이 당사의 귀하에 대한 권리 및 의무를 이전할 수 있습니다.</span
          >
        </p>
        <p class="p2">
          <span class="s1"
            >12.5. 완전한 합의: 본 약관은 서비스에 관한 달오떡과 귀하간의 완전하고
            배타적인 합의를 구성하며, 본 약관은 본 서비스에 관한 달오떡과 귀하간의
            모든 이전의 합의를 대체하고 대신합니다. 당사는 본 약관을 수시로 변경할
            수 있습니다. 당사의 단독 재량에 따라 해당 변경사항이 중대하다고 판단하는
            경우, 당사는 서비스 내 배너 등 적합한 방법을 통해 귀하에게 통지할
            것입니다. 변경사항이 시행된 이후에도 지속적으로 본 서비스에 액세스하거나
            이를 이용함으로써, 귀하는 변경된 본 약관에 구속되는 데 동의합니다.</span
          >
        </p>
        <p class="p2"><span class="s1"> </span></p>
        <p class="p2">
          <span class="s1">이 정책은 아래 시행일자부터 시행됩니다.</span>
        </p>
        <p class="p2"><span class="s1">- 시행일 2021년 10월 3일</span></p>
        <p class="p2"><span class="s1">- 최종수정일: 2021년 10월 3일</span></p>`,
      }}
    />
  );
}
